# Erase Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CategoryNameMap..::..Erase Method
CategoryNameMap Class See Also
---
Removes a category with the specified name from the map.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Erase(
	string key
)
```

Visual Basic
---
```text
Public Overridable Function Erase ( _
	key As String _
) As Integer
```

Visual C++
---
```text
public:
virtual int Erase(
	String^ key
)
```

# ### Parameters
key
    Type: System..::..StringThe name of the category to be erased.
# ### Return Value
The number of categories that were erased from the map.
# See Also
CategoryNameMap Class
Autodesk.Revit.DB Namespace